; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v8 - type_2 ?v1 - type_1)
 	      (pred_1 ?v3 - object ?v1 - type_1)
	      (pred_2 ?v8 - type_2 ?v2 - type_3)
	      (pred_4 ?v8 - type_2 ?v3 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v8 - type_2 ?v6 ?v5 - type_1)
       :precondition (and  (pred_3 ?v8 ?v6))
       :effect (and  (pred_3 ?v8 ?v5)
		     (not (pred_3 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_2 ?v7 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v4) (pred_3 ?v8 ?v4) (pred_2 ?v8 ?v2))
       :effect (and (pred_4 ?v8 ?v7 ?v2)
		    (not (pred_1 ?v7 ?v4)) 
		    (not (pred_2 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_2 ?v7 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v7 ?v2) (pred_3 ?v8 ?v4))
       :effect (and (pred_1 ?v7 ?v4)
		    (pred_2 ?v8 ?v2)
		    (not (pred_4 ?v8 ?v7 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_13 - type_2
obj_07 obj_04 obj_08 obj_10 - type_3
obj_12 obj_09 obj_03 obj_01 - type_1
obj_06 obj_02 obj_05 - object)
(:init
(pred_3 obj_11 obj_09)
(pred_2 obj_11 obj_07)
(pred_2 obj_11 obj_04)
(pred_3 obj_13 obj_03)
(pred_2 obj_13 obj_08)
(pred_2 obj_13 obj_10)
(pred_1 obj_06 obj_01)
(pred_1 obj_02 obj_12)
(pred_1 obj_05 obj_09)
)
(:goal
(and
(pred_1 obj_06 obj_12)
(pred_1 obj_02 obj_01)
(pred_1 obj_05 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_11 obj_12) (pred_3 obj_13 obj_12))))
    (always (not (and (pred_3 obj_11 obj_01) (pred_3 obj_13 obj_01))))
  )
)
)

; plan
1. (op_3 obj_11 obj_09 obj_03)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_03)
   goals met: 1 of 3
2. (op_3 obj_13 obj_03 obj_12)
   deleted: (pred_3 obj_13 obj_03)
   added: (pred_3 obj_13 obj_12)
   goals met: 1 of 3
3. (op_2 obj_13 obj_02 obj_12 obj_10)
   deleted: (pred_1 obj_02 obj_12) (pred_2 obj_13 obj_10)
   added: (pred_4 obj_13 obj_02 obj_10)
   goals met: 1 of 3
4. (op_3 obj_11 obj_03 obj_09)
   deleted: (pred_3 obj_11 obj_03)
   added: (pred_3 obj_11 obj_09)
   goals met: 1 of 3
5. (op_3 obj_13 obj_12 obj_01)
   deleted: (pred_3 obj_13 obj_12)
   added: (pred_3 obj_13 obj_01)
   goals met: 1 of 3
6. (op_1 obj_13 obj_02 obj_01 obj_10)
   deleted: (pred_4 obj_13 obj_02 obj_10)
   added: (pred_1 obj_02 obj_01) (pred_2 obj_13 obj_10)
   goals met: 2 of 3
7. (op_2 obj_13 obj_06 obj_01 obj_08)
   deleted: (pred_1 obj_06 obj_01) (pred_2 obj_13 obj_08)
   added: (pred_4 obj_13 obj_06 obj_08)
   goals met: 2 of 3
8. (op_3 obj_13 obj_01 obj_12)
   deleted: (pred_3 obj_13 obj_01)
   added: (pred_3 obj_13 obj_12)
   goals met: 2 of 3
9. (op_1 obj_13 obj_06 obj_12 obj_08)
   deleted: (pred_4 obj_13 obj_06 obj_08)
   added: (pred_1 obj_06 obj_12) (pred_2 obj_13 obj_08)
   goals met: 3 of 3
